<?
extract($_POST); extract($_GET);
// Редактирование форм
   // Уничтожение переменных
   $lf=array();

   // Какой файл будем редактировать:
   //ВНИМАНИЕ: ТУТ НУЖНО УКАЗАТЬ ИМЯ ФОРМЫ
		//$lf['file']='_user.lf';
		//$lf['file']='_forum.lf';
		//$lf['file']='_newforum.lf';
		//$lf['file']='_news.lf';
		//$lf['file']='_prod.lf';
		//$lf['file']='_reg.lf';
		//$lf['file']='_remember.lf';
		$lf['file']='_test_osen2010.lf';
		//$lf['file']='_test_osen2011.lf';

   // Какие атрибуты в каждом поле вашей будущей формы нужны:
   // (внимание: некоторые поля имеют смысл, не стирайте их, а только добавляйте свои в конце)
   $lfp=array(
      'name'     => 'имя редактируемого поля (если имя уже существует - эта форма заменит старую форму)',
      'type'     => 'тип поля: "text" (текстовое), "password" (со звездочками), "textarea" (многострочное), "radio" (радио-кнопка), "checkbox" (кнопка), "select" (список)',
      'need'     => 'обязательно ли заполнять человеку при регистрации: "1" - да, "0" - нет; если поле обязательно и типа radio/select, то выбрать default значение нельзя (это считается не заполненностью поля)',
      'default'  => 'значение text/password/textarea поля по-умолчанию ИЛИ какой элемент в radio/select выбрать по-умолчанию ИЛИ отметить или checkbox по-умолчанию',
      'value'    => 'значения полей (только для типов radio/checkbox/select): массив полей с разделителем "двойной минус" ("--"), для checkbox возможен всего один элемент (value=...)',
      'textval'  => 'только для radio/checkbox/select: введите через разделитель "двойной минус" ("--") соответсвующиее полю value названия вариантов на экран (и HTML-текст для разделения вариантов), для checkbox только 1 элемент',
      'cols'     => 'только для text/password/textarea: ширина поля (рекомендуется задавать не ширину, а STYLE="width: 100%" - в поле style ниже)',
      'rows'     => 'только для select/textarea: высота поля в textarea (кол-во строк) и для списка: 1 - список будет выпадающим, 2 и более - сколько строк в большом списке',
      'sizemin'  => 'минимальная длина поля (только для типов text/textarea/password), число, введите 0, если не нужно проверять',
      'sizemax'  => 'максимальная длина поля (только для типов text/textarea/password), число, введите 0, если не нужно проверять',
      'check'    => 'метод проверки правильности заполнения: "mail", "url", "icq", "integer", "date" или не нужна проверка (если поле просто текстовое)',
      'check='   => 'проверять на равенство с другим полем (нужно для ввода 2х паролей), введите название другого поля',
      'trim'     => 'удалять крайние пробелы после ввода: 1 - да, 0 - нет',
      'public'   => 'показывать поле или оно скрытое: 1 - да, 0 - нет',
      'save'     => 'сохранять поле в базе данных (2й из двух паролей сохранять не нужно): 1 - да, 0 - нет',
      'style'    => 'любые CSS стили в атрибуте style тега данного поля (не используйльте здесь двойные кавычки или слеште их)',
      'class'    => 'имя CSS класса в атрибуте class тега данного поля',
      'html'     => 'любой HTML-текст во внутрь тега',
      'html1'    => 'любой HTML-текст до тега',
      'html2'    => 'любой HTML-текст после тега',
      'textreg'  => 'название поля на странице регистрации',
      'texterr'  => 'сообщение об ошибке, когда поле заполнено не правильно (опишите требования по заполеннию формы)',
      // не обязательнные поля с произвольными названиями:
      'textinfo' => 'название поля на странице просмотра инфы',
      // ниже можно добавить еще поля, если вы видите в этом смысл
      // '.....' => '.....',
   );

   // Эта константа разрешает выполнение программы _fedit.php:
   define('loginformedit',1);

   // Вызов основного кода, редактирующего вид регистрационных и иных форм:
   include("_fedit.php");

?>
