<?php
$err[0] ="Ошибка отображения страницы!";
$err[99] ="<font size=+3>Ты наверное хацкер :) !<br>Тогда иди тренируйся на <a href=http://padonak.ru/ target='_blank'>http://padonak.ru/</a>";
$err[1] ="<b>Ваш IP-адрес $REMOTE_ADDR использует анонимный, искажающий или публичный прокси-сервер . Вы не можете быть зарегистрированны.";
$err[2] ="<p>Пользователь с такими данными (Логин / Пароль) на нашем сайте не зарегистрирован.</p><p>Буддте внимательны при вводе данных в форму запроса восстановления пароля!</p>";
$err[3] ="Ошибка 3";
$err[4] ="Ошибка 4";
?>
